#todo: Определить в коде  переменные:

# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа

# Вывести все их типы.

#1
x = 1
print(type(x))


#2
x = 3.14

print(type(x))

#3


if x > 1:
    print(x)

x = 10500
print(str(x))

#4
x
if x is None:
    print('x is None')
else:
    print('x is not None')
