#todo: Определить в коде  переменные:

# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа

# Вывести все их типы.

#1
x = 1
print(type(x))


#2
x = 3.14

print(type(x))

#3
True
print(type(True))

#4

print(type(str(x)))

#5
def function():
    x = 1
    y =2
    x > y
print(type(function()))
