#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения с остатком.

x = 100
y = 250

print(x+y)
print(x-y)
print(x/y)
print(x*y)
print(x//y)
print(x%y)
print(x**y)

